backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Flatten
    config:
      batch_input_shape: !!python/tuple
      - null
      - 8
      - 8
      - 512
      data_format: channels_last
      dtype: float32
      name: flatten_4
      trainable: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_10
      trainable: true
      units: 100
      use_bias: true
  - class_name: LeakyReLU
    config:
      alpha: 0.30000001192092896
      name: leaky_re_lu_7
      trainable: true
  - class_name: Dropout
    config:
      name: dropout_7
      noise_shape: null
      rate: 0.5
      seed: null
      trainable: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_11
      trainable: true
      units: 50
      use_bias: true
  - class_name: LeakyReLU
    config:
      alpha: 0.30000001192092896
      name: leaky_re_lu_8
      trainable: true
  - class_name: Dropout
    config:
      name: dropout_8
      noise_shape: null
      rate: 0.3
      seed: null
      trainable: true
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_12
      trainable: true
      units: 12
      use_bias: true
  name: sequential_4
keras_version: 2.2.4
